To Create Similar from a Legend View, first select the element, then activate the target view, then invoke Create Similar.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SwitchFromLegendBeforeCreateSimilar { get; }
  Visual Basic
Public Shared ReadOnly Property SwitchFromLegendBeforeCreateSimilar As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SwitchFromLegendBeforeCreateSimilar {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CreationFailures Class
  Autodesk.Revit.DB Namespace